{
  "type": "UserPlusOnes",
  "version": "Schema Draft Version 0.99",
  "bases": {
    "Thing": [
      {
        "name": "additionalType",
        "description": "An additional type for the item, typically used for adding more specific types from external vocabularies in microdata syntax. This is a relationship between something and a class that the thing is in. In RDFa syntax, it is better to use the native RDFa syntax - the 'typeof' attribute - for multiple types. Schema.org tools may have only weaker understanding of extra types, in particular those defined externally.",
        "type": "URL"
      },
      {
        "name": "description",
        "description": "A short description of the item.",
        "type": "Text"
      },
      {
        "name": "image",
        "description": "URL of an image of the item.",
        "type": "URL"
      },
      {
        "name": "name",
        "description": "The name of the item.",
        "type": "Text"
      },
      {
        "name": "url",
        "description": "URL of the item.",
        "type": "URL"
      }
    ],
    "Event": [
      {
        "name": "attendee",
        "description": "A person or organization attending the event.",
        "type": [
          "Organization",
          "Person"
        ]
      },
      {
        "name": "attendees",
        "description": "A person attending the event (legacy spelling; see singular form, attendee).",
        "type": [
          "Organization",
          "Person"
        ]
      },
      {
        "name": "duration",
        "description": "The duration of the item (movie, audio recording, event, etc.) in ISO 8601 date format.",
        "type": "Duration"
      },
      {
        "name": "endDate",
        "description": "The end date and time of the event (in ISO 8601 date format).",
        "type": "Date"
      },
      {
        "name": "location",
        "description": "The location of the event or organization.",
        "type": [
          "Place",
          "PostalAddress"
        ]
      },
      {
        "name": "offers",
        "description": "An offer to sell this item—for example, an offer to sell a product, the DVD of a movie, or tickets to an event.",
        "type": "Offer"
      },
      {
        "name": "performer",
        "description": "A performer at the event—for example, a presenter, musician, musical group or actor.",
        "type": [
          "Organization",
          "Person"
        ]
      },
      {
        "name": "performers",
        "description": "The main performer or performers of the event—for example, a presenter, musician, or actor (legacy spelling; see singular form, performer).",
        "type": [
          "Organization",
          "Person"
        ]
      },
      {
        "name": "startDate",
        "description": "The start date and time of the event (in ISO 8601 date format).",
        "type": "Date"
      },
      {
        "name": "subEvent",
        "description": "An Event that is part of this event. For example, a conference event includes many presentations, each are a subEvent of the conference.",
        "type": "Event"
      },
      {
        "name": "subEvents",
        "description": "Events that are a part of this event. For example, a conference event includes many presentations, each are subEvents of the conference (legacy spelling; see singular form, subEvent).",
        "type": "Event"
      },
      {
        "name": "superEvent",
        "description": "An event that this event is a part of. For example, a collection of individual music performances might each have a music festival as their superEvent.",
        "type": "Event"
      }
    ]
  }
}